_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 32, 32, 32, 2)     0         
_________________________________________________________________
conv3d_1 (Conv3D)            (None, 32, 32, 32, 32)    1760      
_________________________________________________________________
activation_1 (Activation)    (None, 32, 32, 32, 32)    0         
_________________________________________________________________
conv3d_2 (Conv3D)            (None, 32, 32, 32, 64)    55360     
_________________________________________________________________
activation_2 (Activation)    (None, 32, 32, 32, 64)    0         
_________________________________________________________________
conv3d_3 (Conv3D)            (None, 32, 32, 32, 2)     130       
_________________________________________________________________
activation_3 (Activation)    (None, 32, 32, 32, 2)     0         
=================================================================
Total params: 57,250
Trainable params: 57,250
Non-trainable params: 0
_________________________________________________________________
