__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 48, 48, 48, 1 0                                            
__________________________________________________________________________________________________
conv3d_1 (Conv3D)               (None, 48, 48, 48, 1 448         input_1[0][0]                    
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 48, 48, 48, 1 0           conv3d_1[0][0]                   
__________________________________________________________________________________________________
conv3d_2 (Conv3D)               (None, 48, 48, 48, 3 13856       activation_1[0][0]               
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 48, 48, 48, 3 0           conv3d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling3d_1 (MaxPooling3D)  (None, 24, 24, 24, 3 0           activation_2[0][0]               
__________________________________________________________________________________________________
conv3d_3 (Conv3D)               (None, 24, 24, 24, 3 27680       max_pooling3d_1[0][0]            
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 24, 24, 24, 3 0           conv3d_3[0][0]                   
__________________________________________________________________________________________________
conv3d_4 (Conv3D)               (None, 24, 24, 24, 6 55360       activation_3[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 24, 24, 24, 6 0           conv3d_4[0][0]                   
__________________________________________________________________________________________________
up_sampling3d_1 (UpSampling3D)  (None, 48, 48, 48, 6 0           activation_4[0][0]               
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 48, 48, 48, 9 0           up_sampling3d_1[0][0]            
                                                                 activation_2[0][0]               
__________________________________________________________________________________________________
conv3d_5 (Conv3D)               (None, 48, 48, 48, 3 82976       concatenate_1[0][0]              
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 48, 48, 48, 3 0           conv3d_5[0][0]                   
__________________________________________________________________________________________________
conv3d_6 (Conv3D)               (None, 48, 48, 48, 3 27680       activation_5[0][0]               
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 48, 48, 48, 3 0           conv3d_6[0][0]                   
__________________________________________________________________________________________________
conv3d_7 (Conv3D)               (None, 48, 48, 48, 1 33          activation_6[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 48, 48, 48, 1 0           conv3d_7[0][0]                   
==================================================================================================
Total params: 208,033
Trainable params: 208,033
Non-trainable params: 0
__________________________________________________________________________________________________
